faris1702/SC2079-STM32-Robot/Final/Task 1/main.c
	for (;;){
		if (emergency_stop){
			MotorStop_both();
			break;
		}
		//------------- Turning motion -------------------------
		  error_angle = target_angle - fabsf(angle_direction);
		  error_angle_int = error_angle;
		//------------------------------------------------------

		//--------------- PID Controller -------------------------
		  if (dir > SERVO_MIDDLE){
			  error_left_rpm = (target_rpm) - motor_left_rpm;          //60rpm
			  error_right_rpm = (target_rpm-15.0f) - motor_right_rpm;  //40rpm
		  }
		  else{
			  error_left_rpm = (target_rpm-15.0f) - motor_left_rpm;
			  error_right_rpm = (target_rpm) - motor_right_rpm;
		  }

		  PID_Compute(&pid_left, error_left_rpm, (float)(delay/1000.0f));
		  PID_Compute(&pid_right, error_right_rpm, (float)(delay/1000.0f));

		  __HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_2,pid_left.pwm_output);  //Motor B (left)
		  __HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_4,pid_right.pwm_output); //Motor A (right)
		//-------------------------------------------------------------

		//------------------ Check angle turned --------------------------
		  if ((error_angle) <= 0.0f){
			  MotorStop_both();
			  osDelay(300);
			  htim12.Instance->CCR1 = SERVO_MIDDLE;
			  break;
		  }
		//----------------------------------------------------------------

		  osDelay(delay);
	}

}

void reverseTurn(int dir, float target_angle, float target_rpm, int delay){
	//-------------------- Servo Init -----------------------
	HAL_TIM_PWM_Start(&htim12, TIM_CHANNEL_1);
	htim12.Instance->CCR1 = dir;
	if (dir < SERVO_MIDDLE){
		servo_prev = SERVO_LEFT;
	}
	else{
		servo_prev = SERVO_RIGHT;
	}
	//--------------------------------------------------------

	//-------------------- MOTOR START -----------------------
	setPID(&pid_left, 1.0f, 0.0f, 0.0f, 0);
	setPID(&pid_right, 1.0f, 0.0f, 0.0f, 0);
	MotorDrive_enable();
	Motor_direction_both(0);
	//--------------------------------------------------------

	osDelay(300);
	prev_angle_direction = 0.0f;
	angle_direction = 0.0f;

	for (;;){
		if (emergency_stop){
			MotorStop_both();
			break;
		}
		//------------- Turning motion -------------------------
		  error_angle = target_angle - fabsf(angle_direction);
		  error_angle_int = error_angle;
		//------------------------------------------------------

		//--------------- PID Controller -------------------------
		  if (dir > SERVO_MIDDLE){
			  error_left_rpm = (target_rpm) - motor_left_rpm;          //60rpm
			  error_right_rpm = (target_rpm-15.0f) - motor_right_rpm;  //40rpm
		  }
		  else{
			  error_left_rpm = (target_rpm-15.0f) - motor_left_rpm;
			  error_right_rpm = (target_rpm) - motor_right_rpm;
		  }

		  PID_Compute(&pid_left, error_left_rpm, (float)(delay/1000.0f));
		  PID_Compute(&pid_right, error_right_rpm, (float)(delay/1000.0f));

		  __HAL_TIM_SetCompare(&htim9,TIM_CHANNEL_1,pid_left.pwm_output);  //Motor B (left)
		  __HAL_TIM_SetCompare(&htim4,TIM_CHANNEL_3,pid_right.pwm_output); //Motor A (right)
		//-------------------------------------------------------------

		//------------------ Check angle turned --------------------------
		  if ((error_angle) <= 0.0f){
			  MotorStop_both();
			  osDelay(300);
			  htim12.Instance->CCR1 = SERVO_MIDDLE;
			  break;
		  }
		//----------------------------------------------------------------

		  osDelay(delay);
	}

}

void buzzerOn(int delay){
	HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_8);
	osDelay(delay);
	HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_8);
}

void rotate_wheel(int side){
	HAL_TIM_PWM_Start(&htim12, TIM_CHANNEL_1);
	htim12.Instance->CCR1 = side;
}

//115 - 30deg
//102 - 25
//95 - 20
//90 ~ 15
//86 - 10
//76 - 0
//67 - 10
//63 - 15
//60 - 20
//55 ~ 25
//53 - 30
void convert_from_angle(int angle){
	switch (angle){
		case 30:
			servo_curr = 115;
			break;
		case 25:
			servo_curr = 102;
			break;
		case 20:
			servo_curr = 95;
			break;
		case 15:
			servo_curr = 90;
			break;
		case 10:
			servo_curr = 86;
			break;
		case 0:
			servo_curr = 76;
			break;
		case -10:
			servo_curr = 67;
			break;
		case -15:
			servo_curr = 63;
			break;
		case -20:
			servo_curr = 60;
			break;
		case -25:
			servo_curr = 55;
			break;
		case -30:
			servo_curr = 53;
			break;
	}
}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void *argument)
{
  /* USER CODE BEGIN 5 */

  /* Infinite loop */
  for(;;)
  {

	// Toggle LED every 1s to show that STM not stuck in loop and still running
	HAL_GPIO_TogglePin(LED3_GPIO_Port, LED3_Pin);
	osDelay(1000);

  }
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_show */
/**
* @brief Function implementing the ShowTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_show */
void show(void *argument)
{
  /* USER CODE BEGIN show */
	char buffer[20];

  /* Infinite loop */
  for(;;)
  {
	  sprintf(buffer, "Motor L:%2d R:%2d", motor_left_rpm_int, motor_right_rpm_int);
	  OLED_ShowString(5, 5, buffer);

	  sprintf(buffer, "Dist:%4d", distance_travelled_int);
	  OLED_ShowString(5, 15, buffer);

	  sprintf(buffer, "IR L:%2d R:%2d", ir_dist_left_int, ir_dist_right_int);
	  OLED_ShowString(5, 25, buffer);

	  sprintf(buffer, "US:%3d", us_dist_int);
	  OLED_ShowString(5, 35, buffer);

//	  sprintf(buffer, "Angle:%3d", gyro_z_dps_int);
//	  sprintf(buffer, "%04d-\0", pid_right.pwm_output);
//	  sprintf(buffer, "%04d--", encoder_difference);
//	  OLED_ShowString(5, 45, buffer);


	// Refreshes the OLED screen every 0.5s
	// This is the only refresh function call in all the tasks
	OLED_Refresh_Gram();

    osDelay(250);
  }
  /* USER CODE END show */
}

/* USER CODE BEGIN Header_motors */
/**
* @brief Function implementing the MotorTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_motors */
void motors(void *argument)
{
  /* USER CODE BEGIN motors */

	int flag = 0;
	int count = 0;
	int image_check;
	int start = 0;
	int delay = 500;
	int now;
	float offset = 30.0f;  //rpm = 50 + offset


//	//---------- Starting ----------
	//start only when user button pressed
	osDelay(2000);//delay for ultrasonic init
	rotate_wheel(SERVO_LEFT+10);
	osDelay(500);
	rotate_wheel(SERVO_MIDDLE);
	osDelay(500);

	buzzerOn(1000);
	now = HAL_GetTick();
	while ((HAL_GetTick() - now) < 3000){
		if (HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_0) == RESET){
			offset += 20.0f;
			buzzerOn(100);
			osDelay(1000);
		}
	}
	buzzerOn(1000);
//	//-------------------------------

	//---------- Testing --------------
	//currently, diameter = 63~65
//	forwardTurn(LEFT, 180.0f, 60.0f, 40);
//	reverse(100.0f, 100.0f, 40, 0);
	//---------------------------------


