faris1702/SC2079-STM32-Robot/Final/Task 1/main.c
  /* Infinite loop */
  for(;;)
  {

	  //***** Un-comment to stop *****
//	  osDelay(1000);
//	  continue;
	  //*****************************

	  //------------- Stop the robot after all steps complete -------------------
	  if (flag){
		  osDelay(1000);
		  continue;
	  }
	  //-------------------------------------------------------------------------



	  //---------------- Receiving Instruction from RPi ----------------------
	  if (emergency_stop){
			MotorStop_both();
			flag = 1;
		}

	  osDelay(10);
	  if (!have_instruction){
		  MotorStop_both();
		  continue;
	  }
		//T - forward
		//W - forward_until
		//t - reverse
		//w - reverse_until
	    //{flag}{speed}|{angle}|{value}
	  else{
		  if (instruction[0] == 'S'){
			  buzzerOn(500);
			  osDelay(2000);
		  }


		  else if (instruction[0] == 'F'){
			  buzzerOn(2000);
			  osDelay(1000);
			  flag = 1;
		  }

		  else{
			  osDelay(100);
			  convert_instruction(&instruction);
			  if (i_angle == 0){  //forward or backward
				  switch (i_flag){
					  case 'T':
						  forward(i_speed+offset, i_value, 40, 0);
						  break;
					  case 't':
						  reverse(i_speed+offset, i_value, 40, 0);
						  break;
					  case 'W':
						  forward_until(i_speed+10, i_value, 40, 0);
						  break;
					  case 'w':
						  reverse_until(i_speed+10, i_value, 40, 0);
						  break;
				  }
			  }

			  else if (i_angle > 0){ //turn right
				  if (i_angle > 30) i_angle = 30;
				  convert_from_angle(i_angle);
				  if (i_flag == 'T') {
					  forwardTurn(servo_curr, i_value, 50.0f, 40);
				  }
				  else{
					  reverseTurn(servo_curr, i_value, 50.0f, 40);
				  }
			  }

			  else{ //turn left
				  if (i_angle < -30) i_angle = -30;
				  convert_from_angle(i_angle);
				  sprintf(buffer, "%3d", servo_curr);
				  OLED_ShowString(70, 35, buffer);
				  if (i_flag == 'T'){
					  forwardTurn(servo_curr, i_value, 50.0f, 40);
				  }
				  else{
					  reverseTurn(servo_curr, i_value, 50.0f, 40);
				  }
			  }
		  }

		  sprintf(buffer, "FIN\r\n");
		  HAL_UART_Transmit(&huart3, buffer, strlen(buffer), 0xFFFF);
		  have_instruction = 0;
	  }
//	  //----------------------------------------------------------------------


  }
  /* USER CODE END motors */
}

/* USER CODE BEGIN Header_encoder */
/**
* @brief Function implementing the EncoderTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_encoder */
void encoder(void *argument)
{
  /* USER CODE BEGIN encoder */
  /* Infinite loop */
  // --------------- Right Motor (Motor A) --------------------------
  HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_2);
  HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);

  int cnt1A, cnt2A;
  uint32_t tickA;

  cnt1A = __HAL_TIM_GET_COUNTER(&htim2);
  tickA = HAL_GetTick();
  uint8_t display1[20];
  uint8_t display2[20];
  uint16_t dirA;
  float a = 0.95f;

  for(;;)
  {
    if (HAL_GetTick() - tickA > 40L){
    	cnt2A = __HAL_TIM_GET_COUNTER(&htim2);
    	if (__HAL_TIM_IS_TIM_COUNTING_DOWN(&htim2)){
    		if (cnt2A < cnt1A)
    			motor_right_encoder = cnt1A - cnt2A;
    		else
    			motor_right_encoder = (65535 - cnt2A) + cnt1A;
    	}
    	else{
    		if (cnt2A > cnt1A)
    			motor_right_encoder = cnt2A - cnt1A;
    		else
    			motor_right_encoder = (65535 - cnt1A) + cnt2A;
    	}

    	//------------------------------- with LPF ---------------------------------------
    	if (motor_right_encoder > 250){
    		motor_right_encoder = 0;
    		motor_right_encoder_lpf = 0;
    	}
    	total_right_encoder += motor_right_encoder;
    	motor_right_encoder *= 25;
    	motor_right_rpm = motor_right_encoder / 22.0f; // 60/1320 = 1/22

    	motor_right_encoder_lpf = (motor_right_encoder * (1-a)) + (prev_right_encoder * a);
    	prev_right_encoder = motor_right_encoder_lpf;  // for LPF
    	motor_right_rpm_lpf = motor_right_encoder_lpf / 22.0f; // 60/1320 = 1/22
    	motor_right_rpm_lpf_int = motor_right_rpm_lpf;
    	//---------------------------------------------------------------------------------

    	motor_right_rpm_int = motor_right_rpm;
    	dirA = __HAL_TIM_IS_TIM_COUNTING_DOWN(&htim2);

    	//---------- Reset Procedure ------------
    	cnt1A = __HAL_TIM_GET_COUNTER(&htim2);
	    tickA = HAL_GetTick();
	    //---------------------------------------
    }
  }
  /* USER CODE END encoder */
}

/* USER CODE BEGIN Header_encoder_B */
/**
* @brief Function implementing the EncoderBTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_encoder_B */
void encoder_B(void *argument)
{
  /* USER CODE BEGIN encoder_B */
	// --------------- Left Motor (Motor B) --------------------------
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);
	HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);

	int cnt1A, cnt2A;
	uint32_t tickA;

	cnt1A = __HAL_TIM_GET_COUNTER(&htim3);
	tickA = HAL_GetTick();
	uint8_t display1[20];
	uint8_t display2[20];
	uint16_t dirA;
	float a = 0.95f;

	char sbuf[64];

	for(;;)
	{
	if (HAL_GetTick() - tickA > 40L){
		cnt2A = __HAL_TIM_GET_COUNTER(&htim3);
		if (__HAL_TIM_IS_TIM_COUNTING_DOWN(&htim3)){
			if (cnt2A < cnt1A)
				motor_left_encoder = cnt1A - cnt2A;
			else
				motor_left_encoder = (65535 - cnt2A) + cnt1A;
		}
		else{
			if (cnt2A > cnt1A)
				motor_left_encoder = cnt2A - cnt1A;
			else
				motor_left_encoder = (65535 - cnt1A) + cnt2A;
		}


		//---------------------- with LPF --------------------------
		if (motor_left_encoder > 250){
			motor_left_encoder = 0;
			motor_left_encoder_lpf = 0;
		}
		total_left_encoder += motor_left_encoder;
		motor_left_encoder *= 25;
		motor_left_rpm = motor_left_encoder / 22.0f;  //  60/1320 = 1/22

		motor_left_encoder_lpf = (motor_left_encoder * (1-a)) + (prev_left_encoder * a);  //for LPF
		prev_left_encoder = motor_left_encoder_lpf;  //for LPF
		motor_left_rpm_lpf = motor_left_encoder_lpf / 22.0f;  //  60/1320 = 1/22
		motor_left_rpm_lpf_int = motor_left_rpm_lpf;
		//-----------------------------------------------------------

		motor_left_rpm_int = motor_left_rpm;
		dirA = __HAL_TIM_IS_TIM_COUNTING_DOWN(&htim3);
		dirA = !(dirA);

